MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFE100/mcu.h
extern volatile __ADCDATA31bits_t ADCDATA31bits __asm__ ("ADCDATA31") __attribute__((section("sfrs"), address(0xBF84B27C)));
#define ADCDATA32 ADCDATA32
extern volatile uint32_t   ADCDATA32 __attribute__((section("sfrs"), address(0xBF84B280)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA32bits_t;
extern volatile __ADCDATA32bits_t ADCDATA32bits __asm__ ("ADCDATA32") __attribute__((section("sfrs"), address(0xBF84B280)));
#define ADCDATA33 ADCDATA33
extern volatile uint32_t   ADCDATA33 __attribute__((section("sfrs"), address(0xBF84B284)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA33bits_t;
extern volatile __ADCDATA33bits_t ADCDATA33bits __asm__ ("ADCDATA33") __attribute__((section("sfrs"), address(0xBF84B284)));
#define ADCDATA34 ADCDATA34
extern volatile uint32_t   ADCDATA34 __attribute__((section("sfrs"), address(0xBF84B288)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA34bits_t;
extern volatile __ADCDATA34bits_t ADCDATA34bits __asm__ ("ADCDATA34") __attribute__((section("sfrs"), address(0xBF84B288)));
#define ADCDATA43 ADCDATA43
extern volatile uint32_t   ADCDATA43 __attribute__((section("sfrs"), address(0xBF84B2AC)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA43bits_t;
extern volatile __ADCDATA43bits_t ADCDATA43bits __asm__ ("ADCDATA43") __attribute__((section("sfrs"), address(0xBF84B2AC)));
#define ADCDATA44 ADCDATA44
extern volatile uint32_t   ADCDATA44 __attribute__((section("sfrs"), address(0xBF84B2B0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA44bits_t;
extern volatile __ADCDATA44bits_t ADCDATA44bits __asm__ ("ADCDATA44") __attribute__((section("sfrs"), address(0xBF84B2B0)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF84C000)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF84C000)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF84C004)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF84C008)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF84C00C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF84C010)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF84C010)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF84C014)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF84C018)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF84C01C)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF84C060)));
typedef union {
  struct {
    uint32_t C1OUT:1;
    uint32_t C2OUT:1;
    uint32_t :11;
    uint32_t SIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF84C060)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF84C064)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF84C068)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF84C06C)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF860000)));
typedef union {
  struct {
    uint32_t ANSA0:1;
    uint32_t ANSA1:1;
    uint32_t :3;
    uint32_t ANSA5:1;
    uint32_t :3;
    uint32_t ANSA9:1;
    uint32_t ANSA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF860000)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF860004)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF860008)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF86000C)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF860010)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t TRISA2:1;
    uint32_t TRISA3:1;
    uint32_t TRISA4:1;
    uint32_t TRISA5:1;
    uint32_t TRISA6:1;
    uint32_t TRISA7:1;
    uint32_t :1;
    uint32_t TRISA9:1;
    uint32_t TRISA10:1;
    uint32_t :3;
    uint32_t TRISA14:1;
    uint32_t TRISA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF860010)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF860014)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF860018)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF86001C)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF860020)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t RA2:1;
    uint32_t RA3:1;
    uint32_t RA4:1;
    uint32_t RA5:1;
    uint32_t RA6:1;
    uint32_t RA7:1;
    uint32_t :1;
    uint32_t RA9:1;
    uint32_t RA10:1;
    uint32_t :3;
    uint32_t RA14:1;
    uint32_t RA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF860020)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF860024)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF860028)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF86002C)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF860030)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t LATA2:1;
    uint32_t LATA3:1;
    uint32_t LATA4:1;
    uint32_t LATA5:1;
    uint32_t LATA6:1;
    uint32_t LATA7:1;
    uint32_t :1;
    uint32_t LATA9:1;
    uint32_t LATA10:1;
    uint32_t :3;
    uint32_t LATA14:1;
    uint32_t LATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF860030)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF860034)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF860038)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF86003C)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF860040)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t ODCA2:1;
    uint32_t ODCA3:1;
    uint32_t ODCA4:1;
    uint32_t ODCA5:1;
    uint32_t ODCA6:1;
    uint32_t ODCA7:1;
    uint32_t :1;
    uint32_t ODCA9:1;
    uint32_t ODCA10:1;
    uint32_t :3;
    uint32_t ODCA14:1;
    uint32_t ODCA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF860040)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF860044)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF860048)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF86004C)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF860050)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t CNPUA2:1;
    uint32_t CNPUA3:1;
    uint32_t CNPUA4:1;
    uint32_t CNPUA5:1;
    uint32_t CNPUA6:1;
    uint32_t CNPUA7:1;
    uint32_t :1;
    uint32_t CNPUA9:1;
    uint32_t CNPUA10:1;
    uint32_t :3;
    uint32_t CNPUA14:1;
    uint32_t CNPUA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF860050)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF860054)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF860058)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF86005C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF860060)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t CNPDA2:1;
    uint32_t CNPDA3:1;
    uint32_t CNPDA4:1;
    uint32_t CNPDA5:1;
    uint32_t CNPDA6:1;
    uint32_t CNPDA7:1;
    uint32_t :1;
    uint32_t CNPDA9:1;
    uint32_t CNPDA10:1;
    uint32_t :3;
    uint32_t CNPDA14:1;
    uint32_t CNPDA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF860060)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF860064)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF860068)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF86006C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF860070)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF860070)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF860074)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF860078)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF86007C)));
#define CNENA CNENA
extern volatile uint32_t   CNENA __attribute__((section("sfrs"), address(0xBF860080)));
typedef union {
  struct {
    uint32_t CNIEA0:1;
    uint32_t CNIEA1:1;
    uint32_t CNIEA2:1;
    uint32_t CNIEA3:1;
    uint32_t CNIEA4:1;
    uint32_t CNIEA5:1;
    uint32_t CNIEA6:1;
    uint32_t CNIEA7:1;
    uint32_t :1;
    uint32_t CNIEA9:1;
    uint32_t CNIEA10:1;
    uint32_t :3;
    uint32_t CNIEA14:1;
    uint32_t CNIEA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENAbits_t;
extern volatile __CNENAbits_t CNENAbits __asm__ ("CNENA") __attribute__((section("sfrs"), address(0xBF860080)));
extern volatile uint32_t        CNENACLR __attribute__((section("sfrs"),address(0xBF860084)));
extern volatile uint32_t        CNENASET __attribute__((section("sfrs"),address(0xBF860088)));
extern volatile uint32_t        CNENAINV __attribute__((section("sfrs"),address(0xBF86008C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF860090)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t CNSTATA2:1;
    uint32_t CNSTATA3:1;
    uint32_t CNSTATA4:1;
    uint32_t CNSTATA5:1;
    uint32_t CNSTATA6:1;
    uint32_t CNSTATA7:1;
    uint32_t :1;
    uint32_t CNSTATA9:1;
    uint32_t CNSTATA10:1;
    uint32_t :3;
    uint32_t CNSTATA14:1;
    uint32_t CNSTATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF860090)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF860094)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF860098)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF86009C)));
#define CNNEA CNNEA
extern volatile uint32_t   CNNEA __attribute__((section("sfrs"), address(0xBF8600A0)));
typedef struct {
  uint32_t CNNEA0:1;
  uint32_t CNNEA1:1;
  uint32_t CNNEA2:1;
  uint32_t CNNEA3:1;
  uint32_t CNNEA4:1;
  uint32_t CNNEA5:1;
  uint32_t CNNEA6:1;
  uint32_t CNNEA7:1;
  uint32_t :1;
  uint32_t CNNEA9:1;
  uint32_t CNNEA10:1;
  uint32_t :3;
  uint32_t CNNEA14:1;
  uint32_t CNNEA15:1;
} __CNNEAbits_t;
extern volatile __CNNEAbits_t CNNEAbits __asm__ ("CNNEA") __attribute__((section("sfrs"), address(0xBF8600A0)));
extern volatile uint32_t        CNNEACLR __attribute__((section("sfrs"),address(0xBF8600A4)));
extern volatile uint32_t        CNNEASET __attribute__((section("sfrs"),address(0xBF8600A8)));
extern volatile uint32_t        CNNEAINV __attribute__((section("sfrs"),address(0xBF8600AC)));
#define CNFA CNFA
extern volatile uint32_t   CNFA __attribute__((section("sfrs"), address(0xBF8600B0)));
typedef struct {
  uint32_t CNFA0:1;
  uint32_t CNFA1:1;
  uint32_t CNFA2:1;
  uint32_t CNFA3:1;
  uint32_t CNFA4:1;
  uint32_t CNFA5:1;
  uint32_t CNFA6:1;
  uint32_t CNFA7:1;
  uint32_t :1;
  uint32_t CNFA9:1;
  uint32_t CNFA10:1;
  uint32_t :3;
  uint32_t CNFA14:1;
  uint32_t CNFA15:1;
} __CNFAbits_t;
